Revit 2027 API
TableCellStyleOverrideOptions.BackgroundColor Property
 Indicates if the background color characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BackgroundColor { get; set; }
Public Property BackgroundColor As Boolean
	Get
	Set
public:
property bool BackgroundColor {
	bool get ();
	void set (bool value);
}
member BackgroundColor : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace